{
  "phases": [
    {
      "phase_name": "Менструальная фаза (общая)",
      "level": "phase",
      "symptoms": [
        "Боли и спазмы внизу живота, тяжесть/боль в пояснице, усталость и сонливость, головные боли, вздутие живота, чувствительность/боль в груди, снижение энергии и выносливости, возможное снижение настроения, раздражительность, слезливость, снижение концентрации, повышенная чувствительность к боли и холоду."
      ],
      "behavior": [
        "Тяга к уединению и покою, снижение инициативности, меньше желания общаться и выходить из дома, повышенная чувствительность к тону и критике, возможная резкая смена настроения, предпочтение привычных и \"безопасных\" активностей, фокус на комфорте и базовых потребностях (сон, еда, тепло)."
      ],
      "male_recommendations": [
        "Спрашивать напрямую: «Как я могу тебе помочь сейчас?»",
        "Брать на себя больше бытовых задач, не напоминая об этом.",
        "Не обесценивать состояние (\"ну ты же каждый месяц так\").",
        "Не начинать тяжёлые разговоры и разбор конфликтов.",
        "Следить за комфортом: тепло, еда, вода, обезболивающее (если она использует).",
        "Проявлять мягкость в словах и тоне, говорить медленнее и спокойнее.",
        "Быть терпеливым к перепадам настроения и не принимать их на личный счёт."
      ],
      "subphases": [
        {
          "subphase_name": "Менструальная фаза — начальный период",
          "level": "subphase",
          "stage": "early",
          "symptoms": [
            "Наиболее сильные спазмы и боль, возможна тошнота, слабость, головокружение, максимальное падение энергии, усиление раздражительности и плаксивости, может хотеться лежать и не разговаривать вообще."
          ],
          "behavior": [
            "Резкое снижение терпимости к шуму, яркому свету и людям, желание \"отключиться\", минимальное желание разговаривать, возможные резкие короткие реакции на мелочи, стремление к контролю над пространством (своё место, одеяло, тишина)."
          ],
          "male_recommendations": [
            "Максимизируйте заботу и минимизируйте требования к ней.",
            "Спросите: «Хочешь, я просто побуду рядом и помолчу?»",
            "Не обижайтесь, если она отвечает односложно или выглядит холодной.",
            "Организуйте ей \"капсулу комфорта\": плед, тёплую грелку/подушку, воду/чай.",
            "По возможности отмените/перенесите общие активные планы.",
            "Следите, чтобы она поела и не оставалась совсем без сил.",
            "Не трогайте тему внешности и секса, если она сама это не инициирует."
          ]
        },
        {
          "subphase_name": "Менструальная фаза — середина периода",
          "level": "subphase",
          "stage": "mid",
          "symptoms": [
            "Боль и дискомфорт сохраняются, но обычно снижаются, немного возвращается энергия, но быстро истощается; могут сохраняться вздутие и тяжесть в теле, эмоциональная чувствительность остаётся, но острота снижается."
          ],
          "behavior": [
            "Появляется чуть больше готовности к общению, но в мягком формате; желание \"спокойного быта\" (фильм, еда, тёплый душ); возможна потребность в подтверждении, что её любят и принимают в таком состоянии."
          ],
          "male_recommendations": [
            "Предлагайте «мягкие» активности: фильм, прогулка медленным шагом.",
            "Говорите больше тёплых, конкретных слов поддержки и принятия.",
            "Аккуратно спрашивайте, что ей сейчас приятно, а что нет (объятия, прикосновения).",
            "Не настаивайте на сексе, даже если ей стало чуть лучше.",
            "Помогайте с бытом \"по умолчанию\", не ожидая благодарности каждый раз.",
            "Избегайте сарказма и шуток по поводу её состояния.",
            "Ненавязчиво напоминайте, что это пройдёт, и вы рядом."
          ]
        },
        {
          "subphase_name": "Менструальная фаза — заключительный период",
          "level": "subphase",
          "stage": "late",
          "symptoms": [
            "Кровотечение уменьшается, боль обычно слабеет или исчезает, силы начинают возвращаться, но может оставаться лёгкая усталость, иногда головные боли, эмоционально — плавный выход из \"дна\", но чувствительность ещё повышена."
          ],
          "behavior": [
            "Постепенный возврат интереса к делам и людям, больше готовности планировать, желание \"вернуться к жизни\", но возможны короткие эмоциональные всплески при переутомлении."
          ],
          "male_recommendations": [
            "Поддержите её первые желания \"оживать\", но не перегружайте планами.",
            "Можно мягко предлагать лёгкие совместные активности вне дома.",
            "Хвалите её тело не за внешний вид, а за выносливость (\"ты круто выдерживаешь это\").",
            "Не обесценивайте остаточную усталость фразами типа «ну всё, уже же закончилось».",
            "Обсуждайте на будущее, что помогло/не помогло в этот цикл.",
            "Подчёркивайте, что замечаете её усилия, а не только её симптомы.",
            "Если фаза близится к завершению — мягко переходите к более активным планам на фолликулярную."
          ]
        }
      ]
    },
    {
      "phase_name": "Фолликулярная фаза (общая информация)",
      "level": "phase",
      "symptoms": [
        "Постепенный рост энергии, улучшение настроения, снижение боли, лёгкость в теле, улучшение концентрации, иногда улучшение кожи, повышается интерес к работе, новым задачам и людям, ближе к овуляции нарастает либидо."
      ],
      "behavior": [
        "Больше инициативы, открытости, оптимизма, желание планировать, учиться, знакомиться; растёт терпимость к стрессу и способность решать задачи; чаще тянет к социальной активности и совместным проектам; лёгкость в флирте и юморе."
      ],
      "male_recommendations": [
        "Планируйте на эту фазу важные разговоры и совместные проекты.",
        "Предлагайте интеллектуальные и социальные активности (поездки, встречи).",
        "Поддерживайте её инициативы и идеи, не \"приземляйте\" сразу.",
        "Подчёркивайте её компетентность и ум, а не только внешность.",
        "Можно аккуратно усиливать романтику и флирт.",
        "Делайте совместный спорт/активность — энергия часто позволяет.",
        "Фиксируйте, что сейчас \"её сильные дни\", и используйте это во благо пары."
      ],
      "subphases": [
        {
          "subphase_name": "Фолликулярная фаза — начальный период",
          "level": "subphase",
          "stage": "early",
          "symptoms": [
            "Энергия начинает расти, но ещё не на максимуме, возможна остаточная усталость, настроение выравнивается, снижается боль и тяжесть, когнитивно становится легче думать и концентрироваться."
          ],
          "behavior": [
            "Ощущение \"выхода из спячки\", желание наводить порядок (в доме, делах, планах), появление интереса к людям, но пока в умеренном объёме, аккуратное возвращение к тренировкам и нагрузкам."
          ],
          "male_recommendations": [
            "Помогите ей \"перезапустить\" быт: уборка, планы на неделю, организация пространства.",
            "Предлагайте лёгкие активности: прогулки, кафе, хобби.",
            "Поддержите её ощущения обновления: \"как будто новая глава началась\".",
            "Не требуйте сразу прежней работоспособности — рост энергии постепенный.",
            "Можно начать мягко обсуждать планы на месяц, отпуск, проекты.",
            "Хвалите её за то, как она прошла менструальную фазу.",
            "Если фаза только началась — не перегружайте большими решениями в первый же день."
          ]
        },
        {
          "subphase_name": "Фолликулярная фаза — середина периода",
          "level": "subphase",
          "stage": "mid",
          "symptoms": [
            "Высокая или близкая к максимальной энергия, хорошее самочувствие, ясная голова, повышенная мотивация, хорошее настроение, часто — ощущение уверенности в себе и в теле, может усиливаться либидо."
          ],
          "behavior": [
            "Максимум продуктивности и социальности: легче принимать решения, генерировать идеи, знакомиться, инициировать проекты; больше терпимости к стрессу и конструктивности в конфликтах."
          ],
          "male_recommendations": [
            "Планируйте важные разговоры, сложные темы, стратегию на будущее.",
            "Поддерживайте её амбиции: учёба, карьера, проекты, спорт.",
            "Делайте совместные активные дела: путешествия, спорт, новые впечатления.",
            "Можно усиливать романтические и сексуальные инициативы — часто здесь высокий отклик.",
            "Прислушивайтесь к её идеям — сейчас часто \"лучший умственный тонус\".",
            "Предлагайте совместное планирование финансов/целей — она более рациональна и спокойна.",
            "Если это середина фазы — помните, что пик овуляции ещё впереди, и энергия может расти дальше."
          ]
        },
        {
          "subphase_name": "Фолликулярная фаза — заключительный период (приближение к овуляции)",
          "level": "subphase",
          "stage": "late",
          "symptoms": [
            "Очень высокая энергия, повышенное либидо, ощущение привлекательности, хорошее настроение, часто — повышенная общительность и креативность."
          ],
          "behavior": [
            "Флирт, тёплая экспрессивность, желание быть в центре внимания или хотя бы чувствовать внимание партнёра, активное общение, желание пробовать новое."
          ],
          "male_recommendations": [
            "Усильте внимание и комплименты, особенно про её привлекательность и живость.",
            "Организуйте свидания, романтические жесты, совместные вылазки.",
            "Будьте открыты к сексуальной инициативе и фантазиям с её стороны.",
            "Поддерживайте её креативность — совместные идеи, проекты, планы.",
            "Фиксируйте этот период как время \"максимальной связности\" пары — больше совместности.",
            "Не игнорируйте её флирт — это прямой канал укрепления связи.",
            "Помните, что скоро начнётся овуляция и затем более спокойная/напряжённая лютеиновая — используйте этот период для накопления \"эмоционального ресурса\"."
          ]
        }
      ]
    },
    {
      "phase_name": "Овуляция",
      "level": "phase",
      "symptoms": [
        "Пик энергии и либидо, ощущение максимальной привлекательности, улучшение настроения, иногда — небольшие перепады, но в целом позитивный фон."
      ],
      "behavior": [
        "Высокая открытость к близости (эмоциональной и физической), повышенный интерес к партнёру и сексу, инициирование контакта, желание подтверждения своей желанности, лёгкость в коммуникации и флирте, готовность к новым впечатлениям и риску."
      ],
      "male_recommendations": [
        "Максимально проявляйте внимание, желание и интерес к ней как к женщине.",
        "Планируйте свидания, секс, романтические жесты именно в эти дни.",
        "Говорите больше слов восхищения её внешностью и женственностью.",
        "Будьте инициативны, но обязательно чутки к её реакции.",
        "Обсуждайте мечты и планы пары — она обычно более открыта и позитивна.",
        "Можно \"закладывать\" позитивные общие воспоминания именно на эту фазу.",
        "Берегите её доверие — не обесценивайте её желание близости и открытость."
      ]
    },
    {
      "phase_name": "Лютеиновая фаза (общая информация)",
      "level": "phase",
      "symptoms": [
        "После овуляции постепенно растёт прогестерон: возможны вздутие живота, повышенный аппетит, тяга к сладкому/солёному, усталость, снижение энергии, ухудшение сна, усиление тревожности или подавленности, раздражительность; ближе к менструации — выраженные симптомы ПМС."
      ],
      "behavior": [
        "Больше чувствительности к критике и отвержению, снижается терпимость к хаосу и неопределённости, растёт потребность в подтверждении любви и безопасности, возможно избегание конфликтов или наоборот вспышки раздражения, склонность к самокритике."
      ],
      "male_recommendations": [
        "Учитывать, что это \"эмоционально более тяжёлая\" часть цикла.",
        "Чаще проговаривать поддержку, принятие и стабильность (\"я с тобой, мы в порядке\").",
        "Стараться не провоцировать конфликты по мелочам, отложить несрочные разборки.",
        "Помогать снижать нагрузку и стресс, где возможно.",
        "Сохранять спокойный тон даже при её вспышках.",
        "Напоминать о режиме сна, питании, отдыхе без назидательности.",
        "Если часто тяжело — вместе обсудить \"план лютеиновой фазы\" заранее."
      ],
      "subphases": [
        {
          "subphase_name": "Лютеиновая — начальный период (сразу после овуляции)",
          "level": "subphase",
          "stage": "early",
          "symptoms": [
            "Может сохраняться хорошая энергия, но уже не пик; грудь становится более чувствительной, постепенно усиливается аппетит, возможна лёгкая раздражительность и снижение терпимости к стрессу, но ещё без сильного ПМС."
          ],
          "behavior": [
            "Внешне она может выглядеть всё ещё достаточно собранной и функциональной, но внутри уже немного меньше гибкости; сильнее тянет к домашнему уюту, \"гнездованию\", уменьшению внешней активности."
          ],
          "male_recommendations": [
            "Переводите фокус пары от экстремальных активностей к более домашним и спокойным.",
            "Хвалите её за заботу о доме/семье, если это для неё важно.",
            "Чуть увеличьте поддержку в быту, не дожидаясь явных жалоб.",
            "Обсуждайте заранее, что в этой части цикла лучше не брать на себя слишком много внешних обязательств.",
            "Не интерпретируйте её снижение активности как потерю интереса к вам.",
            "Уточняйте, не доставляет ли дискомфорт физическая близость (грудь, объятия).",
            "Помните, что это \"переход\" к более напряжённой поздней лютеиновой."
          ]
        },
        {
          "subphase_name": "Лютеиновая — середина периода",
          "level": "subphase",
          "stage": "mid",
          "symptoms": [
            "Усиление типичных ПМС-признаков: вздутие, отёчность, боли в груди, усталость, снижение настроения, повышенная раздражительность, слезливость, перепады от злости к апатии, трудности с концентрацией."
          ],
          "behavior": [
            "Может казаться \"колючей\" или закрытой, может усиливаться склонность видеть в себе и в отношениях только плохое, повышенная чувствительность к нюансам речи/мимики, возможна вспыльчивость, после которой ей самой стыдно."
          ],
          "male_recommendations": [
            "Не спорьте с её чувствами (\"ты преувеличиваешь\"), признавайте их реальность.",
            "Разделяйте: её эмоции настоящие, но выводы сейчас могут быть искажены гормонами.",
            "Старайтесь не отвечать агрессией на агрессию — выведите ситуацию на паузу.",
            "Напоминайте, что любите её и в таком состоянии тоже.",
            "Можете мягко предложить физическое облегчение: массаж спины, тёплая ванна.",
            "Не подкидывайте новых стрессов (спорные темы, жёсткая критика).",
            "Проговорите, что вы осознаёте: сейчас \"сложная фаза\", и вы рядом, а не против неё."
          ]
        },
        {
          "subphase_name": "Лютеиновая — заключительный период (предменструальный, ПМС-пик)",
          "level": "subphase",
          "stage": "late",
          "symptoms": [
            "Пик ПМС: сильные перепады настроения, раздражительность, слёзы без очевидной причины, чувство внутреннего напряжения, возможны тревога, мрачные мысли, усиление болевых ощущений, проблемы со сном и концентрацией, чувство \"отвращения\" к своему телу, усиленный аппетит и тяга к определённой пище."
          ],
          "behavior": [
            "Может возникать ощущение, что она \"самая плохая\"/\"всё рушится\", усиление чувствительности к страху отвержения, резкие реакции на мелочи, желание то приближаться, то отдаляться; возможны \"чёрно-белые\" оценки (\"у нас всё плохо\")."
          ],
          "male_recommendations": [
            "Держите в голове: это пик гормональной нагрузки, а не \"её настоящий характер\".",
            "Чётко разделяйте: вы не обязаны терпеть унижения, но можете быть мягким и устойчивым.",
            "Если она открыта — вместе договоритесь о \"правилах ПМС\": больше тишины, меньше задач, больше поддержки.",
            "Не воспринимайте всерьёз окончательные фразы (\"всё плохо\", \"у нас ничего не получится\") именно в эти дни — возвращайтесь к ним позже, если нужно.",
            "Подчеркивайте стабильность: \"мы команда, это фаза, она пройдёт\".",
            "Помогите ей уменьшить стимулы: меньше новостей, соцсетей, внешних встреч.",
            "Напоминайте, что через несколько дней начнётся менструальная фаза и многое станет эмоционально легче."
          ]
        }
      ]
    }
  ]
}
